In [1]:
# import classes for python application
from pyspark.sql import SparkSession, DataFrame, functions, Row
from pyspark import SparkContext, SparkConf
from pyspark.sql.types import *

import pandas as pd
from sqlalchemy import create_engine

import os
import sys
import pyarrow as pa
import pyarrow.parquet as pq
os.environ['PYSPARK_PYTHON'] = sys.executable
os.environ['PYSPARK_DRIVER_PYTHON'] = sys.executable

# create spark session, configuration and context
spark = SparkSession.builder.appName("DataFrame").getOrCreate()
conf = SparkConf().setMaster("local").setAppName("Assignment 4")
sc = SparkContext.getOrCreate(conf=conf)

Using Spark's default log4j profile: org/apache/spark/log4j-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
22/02/26 12:46:34 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [2]:
# MySQL connection
db_url = 'mysql+pymysql://retailer:hello1234@localhost/classicmodels'
mysql = create_engine(db_url)

In [3]:
# write employees table to CSV file and check the results
sql_query = "SELECT * FROM employees"
pd.read_sql(sql_query, mysql).to_csv('./employees.csv')
display(pd.read_csv('./employees.csv').head())

# write offices table to CSV file and check the results
sql_query = "SELECT * FROM offices"
pd.read_sql(sql_query, mysql).to_csv('./offices.csv')
display(pd.read_csv('./offices.csv').head())

,Unnamed: 0,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
1,1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
2,2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
3,3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
4,4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)

,Unnamed: 0,officeCode,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
0,0,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NaN
1,1,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NaN
2,2,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NaN
3,3,4,Paris,+33 14 723 4404,43 Rue Jouffroy D'abbans,NaN,NaN,France,75017,EMEA
4,4,5,Tokyo,+81 33 224 5000,4-1 Kioicho,NaN,Chiyoda-Ku,Japan,102-8578,Japan

In [4]:
#create spark dataframe with contents from the employees table, display top 5 rows and count

df_employees = spark.read.format("csv").option("header", "true").option("inferSchema", "true").load("employees.csv")
print('employee count and show top 5: ', df_employees.count(), df_employees.show(5))

#create spark dataframe with contents from the offices table, display top 5 rows and count

df_offices = spark.read.format("csv").option("header", "true").option("inferSchema", "true").load("offices.csv")
print('offices count and show top 5: ', df_offices.count(), df_offices.show(5))

22/02/26 12:46:48 WARN CSVHeaderChecker: CSV header does not conform to the schema.
 Header: , employeeNumber, lastName, firstName, extension, email, officeCode, reportsTo, jobTitle
 Schema: _c0, employeeNumber, lastName, firstName, extension, email, officeCode, reportsTo, jobTitle
Expected: _c0 but found:
CSV file: file:///home/f_dev/big_data/employees.csv

+---+--------------+---------+---------+---------+--------------------+----------+---------+--------------------+
|_c0|employeeNumber| lastName|firstName|extension|               email|officeCode|reportsTo|            jobTitle|
+---+--------------+---------+---------+---------+--------------------+----------+---------+--------------------+
|  0|          1002|   Murphy|    Diane|    x5800|dmurphy@classicmo...|         1|     null|           President|
|  1|          1056|Patterson|     Mary|    x4611|mpatterso@classic...|         1|   1002.0|            VP Sales|
|  2|          1076| Firrelli|     Jeff|    x9273|jfirrelli@classic...|         1|   1002.0|        VP Marketing|
|  3|          1088|Patterson|  William|    x4871|wpatterson@classi...|         6|   1056.0|Sales Manager (APAC)|
|  4|          1102|   Bondur|   Gerard|    x5408|gbondur@classicmo...|         4|   1056.0| Sale Manager (EMEA)|
+---+--------------+---------+---------+---------+--------------------+----------+---------+--------------------+
only showing top 5 rows

employee count and show top 5:  24 None
+---+----------+-------------+---------------+--------------------+------------+----------+-------+----------+---------+
|_c0|officeCode|         city|          phone|        addressLine1|addressLine2|     state|country|postalCode|territory|
+---+----------+-------------+---------------+--------------------+------------+----------+-------+----------+---------+
|  0|         1|San Francisco|+1 650 219 4782|   100 Market Street|   Suite 300|        CA|    USA|     94080|       NA|
|  1|         2|       Boston|+1 215 837 0825|    1550 Court Place|   Suite 102|        MA|    USA|     02107|       NA|
|  2|         3|          NYC|+1 212 555 3000|523 East 53rd Street|     apt. 5A|        NY|    USA|     10022|       NA|
|  3|         4|        Paris|+33 14 723 4404|43 Rue Jouffroy D...|        null|      null| France|     75017|     EMEA|
|  4|         5|        Tokyo|+81 33 224 5000|         4-1 Kioicho|        null|Chiyoda-Ku|  Japan|  102-8578|    Japan|
+---+----------+-------------+---------------+--------------------+------------+----------+-------+----------+---------+
only showing top 5 rows

offices count and show top 5:  8 None

22/02/26 12:46:50 WARN CSVHeaderChecker: CSV header does not conform to the schema.
 Header: , officeCode, city, phone, addressLine1, addressLine2, state, country, postalCode, territory
 Schema: _c0, officeCode, city, phone, addressLine1, addressLine2, state, country, postalCode, territory
Expected: _c0 but found:
CSV file: file:///home/f_dev/big_data/offices.csv

### Queries on the MySQL side

##### Inner Join between tables employees and offices

Inner Join -> ```SELECT e.lastName, e.firstName, o.city, o.country FROM employees e, offices o where e.officeCode = o.officeCode;``` </br>

The inner join query returned (23), which is different from the number of rows in the table employees (24) because we inserted a new row without having officeCode as a constraint.

##### Repeat query only returning 4 rows
```
+-----------+-----------+---------------+---------+
| lastName  | firstName | city          | country |
+-----------+-----------+---------------+---------+
| Murphy    | Diane     | San Francisco | USA     |
| Patterson | Mary      | San Francisco | USA     |
| Firrelli  | Jeff      | San Francisco | USA     |
| Bow       | Anthony   | San Francisco | USA     |
+-----------+-----------+---------------+---------+
```

### Queries in Spark

In [5]:
#create temp view for employees
df_employees.createOrReplaceTempView("employees")
#create temp view for employees
df_offices.createOrReplaceTempView("offices")

In [6]:
# Retrieve number of rows from Inner Join between employees and offices tables
spark.sql("SELECT e.lastName, e.firstName, o.city, o.country FROM employees e, offices o where e.officeCode = o.officeCode").count()

23

In [7]:
#Retrieve number of rows in employees table
spark.sql("SELECT * FROM employees").count()

24

The inner join query returned (23), which is different from the number of rows in the table employees (24) because we inserted a new row without having officeCode as a constraint.

In [8]:
#Repeat Inner Join queries between employees and offices only limiting to 4 rows
spark.sql("SELECT e.lastName, e.firstName, o.city, o.country FROM employees e, offices o where e.officeCode = o.officeCode LIMIT 4;").show()

+---------+---------+-------------+---------+
| lastName|firstName|         city|  country|
+---------+---------+-------------+---------+
|   Murphy|    Diane|San Francisco|      USA|
|Patterson|     Mary|San Francisco|      USA|
| Firrelli|     Jeff|San Francisco|      USA|
|Patterson|  William|       Sydney|Australia|
+---------+---------+-------------+---------+

### Queries on the MySQL side

Outer Join -> ```SELECT e.lastName, e.firstName, o.city, o.country FROM employees e LEFT OUTER JOIN offices o ON e.officeCode = o.officeCode union SELECT e.lastName, e.firstName, o.city, o.country FROM employees e RIGHT OUTER JOIN offices o ON e.officeCode = o.officeCode;```

The outer join query returned 25 rows which is different from the 24 rows in the employees' table. There is a difference because we added an additional office to the office table without a constraint for officeCode.

Primary and Foreign keys do not match -> ```SELECT e.lastName, e.firstName, o.city, o.country, e.officeCode FROM employees e LEFT OUTER JOIN offices o ON e.officeCode = o.officeCode where o.officeCode IS NULL union SELECT e.lastName, e.firstName, o.city, o.country, o.officeCode FROM employees e RIGHT OUTER JOIN offices o ON e.officeCode = o.officeCode where e.officeCode IS NULL;``` </br>

The repeat query where the primary and foreign keys do not match return the 2 rows below, which include the additional employee that we were instructed to create and the office.

```
----------+-----------+-------+---------+------------+
| lastName | firstName | city  | country | officeCode |
+----------+-----------+-------+---------+------------+
| Michaels | Dana      | NULL  | NULL    | 17         |
| NULL     | NULL      | NYC 2 | USA     | 8          |
+----------+-----------+-------+---------+------------+
```

### Queries in Spark

In [9]:
#full outer join query in spark
spark.sql("SELECT e.lastName, e.firstName, o.city, o.country FROM employees e LEFT OUTER JOIN offices o ON e.officeCode = o.officeCode union SELECT e.lastName, e.firstName, o.city, o.country FROM employees e RIGHT OUTER JOIN offices o ON e.officeCode = o.officeCode;").count()

25

In [10]:
#Retrieve number of rows in employees table
spark.sql("SELECT * FROM employees").count()

24

The outer join query returned 25 rows which is different from the 24 rows in the employees' table. There is a difference because we added an additional office to the office table without a constraint for officeCode.

In [11]:
#returns count for rows where primary and foreign keys do not match

spark.sql("SELECT e.lastName, e.firstName, o.city, o.country, e.officeCode FROM employees e LEFT OUTER JOIN offices o ON e.officeCode = o.officeCode where o.officeCode IS NULL union SELECT e.lastName, e.firstName, o.city, o.country, o.officeCode FROM employees e RIGHT OUTER JOIN offices o ON e.officeCode = o.officeCode where e.officeCode IS NULL;").count()

2

In [12]:
#displays rows where primary and foreign keys do not match
spark.sql("SELECT e.lastName, e.firstName, o.city, o.country, e.officeCode FROM employees e LEFT OUTER JOIN offices o ON e.officeCode = o.officeCode where o.officeCode IS NULL union SELECT e.lastName, e.firstName, o.city, o.country, o.officeCode FROM employees e RIGHT OUTER JOIN offices o ON e.officeCode = o.officeCode where e.officeCode IS NULL;").show()

+--------+---------+-----+-------+----------+
|lastName|firstName| city|country|officeCode|
+--------+---------+-----+-------+----------+
|Michaels|     Dana| null|   null|        17|
|    null|     null|NYC 2|    USA|         8|
+--------+---------+-----+-------+----------+

In [13]:
# employees table count
spark.sql("SELECT * FROM employees").count()

24

The count in the condition where the primary and foreign keys do not match is 2. The row count is different from the employees table because in the query we are only selecting the employee and office that we were instructed to create at the beginning of the assignment.

### Queries on the MySQL side

Left Join -> ``` SELECT e.lastName, e.firstName, o.city, o.country FROM employees e LEFT OUTER JOIN offices o ON e.officeCode = o.officeCode;``` </br>
Right Join -> ``` SELECT e.lastName, e.firstName, o.city, o.country FROM employees e RIGHT OUTER JOIN offices o ON e.officeCode = o.officeCode;```</br>

#### The number of rows returned from both the Left and Right outer joins is 24.

#### Result from Left Join:
```
----------+-----------+---------------+-----------+
| lastName  | firstName | city          | country   |
+-----------+-----------+---------------+-----------+
| Murphy    | Diane     | San Francisco | USA       |
| Patterson | Mary      | San Francisco | USA       |
| Firrelli  | Jeff      | San Francisco | USA       |
| Patterson | William   | Sydney        | Australia |
| Bondur    | Gerard    | Paris         | France    |
| Bow       | Anthony   | San Francisco | USA       |
| Jennings  | Leslie    | San Francisco | USA       |
| Thompson  | Leslie    | San Francisco | USA       |
| Firrelli  | Julie     | Boston        | USA       |
| Patterson | Steve     | Boston        | USA       |
| Tseng     | Foon Yue  | NYC           | USA       |
| Vanauf    | George    | NYC           | USA       |
| Bondur    | Loui      | Paris         | France    |
| Hernandez | Gerard    | Paris         | France    |
| Castillo  | Pamela    | Paris         | France    |
| Bott      | Larry     | London        | UK        |
| Jones     | Barry     | London        | UK        |
| Fixter    | Andy      | Sydney        | Australia |
| Marsh     | Peter     | Sydney        | Australia |
| King      | Tom       | Sydney        | Australia |
| Nishi     | Mami      | Tokyo         | Japan     |
| Kato      | Yoshimi   | Tokyo         | Japan     |
| Gerard    | Martin    | Paris         | France    |
| Michaels  | Dana      | NULL          | NULL      |
+-----------+-----------+---------------+-----------+
```

#### Result from Right Join:
```
-----------+-----------+---------------+-----------+
| lastName  | firstName | city          | country   |
+-----------+-----------+---------------+-----------+
| Murphy    | Diane     | San Francisco | USA       |
| Patterson | Mary      | San Francisco | USA       |
| Firrelli  | Jeff      | San Francisco | USA       |
| Bow       | Anthony   | San Francisco | USA       |
| Jennings  | Leslie    | San Francisco | USA       |
| Thompson  | Leslie    | San Francisco | USA       |
| Firrelli  | Julie     | Boston        | USA       |
| Patterson | Steve     | Boston        | USA       |
| Tseng     | Foon Yue  | NYC           | USA       |
| Vanauf    | George    | NYC           | USA       |
| Bondur    | Gerard    | Paris         | France    |
| Bondur    | Loui      | Paris         | France    |
| Hernandez | Gerard    | Paris         | France    |
| Castillo  | Pamela    | Paris         | France    |
| Gerard    | Martin    | Paris         | France    |
| Nishi     | Mami      | Tokyo         | Japan     |
| Kato      | Yoshimi   | Tokyo         | Japan     |
| Patterson | William   | Sydney        | Australia |
| Fixter    | Andy      | Sydney        | Australia |
| Marsh     | Peter     | Sydney        | Australia |
| King      | Tom       | Sydney        | Australia |
| Bott      | Larry     | London        | UK        |
| Jones     | Barry     | London        | UK        |
| NULL      | NULL      | NYC 2         | USA       |
+-----------+-----------+---------------+-----------+
```

### Queries in Spark

In [14]:
# left outer join count
spark.sql("SELECT e.lastName, e.firstName, o.city, o.country FROM employees e\
          LEFT OUTER JOIN offices o ON e.officeCode = o.officeCode;").count()

24

In [15]:
#left outer join displayed
spark.sql("SELECT e.lastName, e.firstName, o.city, o.country FROM employees e\
          LEFT OUTER JOIN offices o ON e.officeCode = o.officeCode;").show(24)

+---------+---------+-------------+---------+
| lastName|firstName|         city|  country|
+---------+---------+-------------+---------+
|   Murphy|    Diane|San Francisco|      USA|
|Patterson|     Mary|San Francisco|      USA|
| Firrelli|     Jeff|San Francisco|      USA|
|Patterson|  William|       Sydney|Australia|
|   Bondur|   Gerard|        Paris|   France|
|      Bow|  Anthony|San Francisco|      USA|
| Jennings|   Leslie|San Francisco|      USA|
| Thompson|   Leslie|San Francisco|      USA|
| Firrelli|    Julie|       Boston|      USA|
|Patterson|    Steve|       Boston|      USA|
|    Tseng| Foon Yue|          NYC|      USA|
|   Vanauf|   George|          NYC|      USA|
|   Bondur|     Loui|        Paris|   France|
|Hernandez|   Gerard|        Paris|   France|
| Castillo|   Pamela|        Paris|   France|
|     Bott|    Larry|       London|       UK|
|    Jones|    Barry|       London|       UK|
|   Fixter|     Andy|       Sydney|Australia|
|    Marsh|    Peter|       Sydney|Australia|
|     King|      Tom|       Sydney|Australia|
|    Nishi|     Mami|        Tokyo|    Japan|
|     Kato|  Yoshimi|        Tokyo|    Japan|
|   Gerard|   Martin|        Paris|   France|
| Michaels|     Dana|         null|     null|
+---------+---------+-------------+---------+

In [16]:
#right outer join count
spark.sql("SELECT e.lastName, e.firstName, o.city, o.country FROM employees e\
          RIGHT OUTER JOIN offices o ON e.officeCode = o.officeCode;").count()

24

In [17]:
#right outer join report
spark.sql("SELECT e.lastName, e.firstName, o.city, o.country FROM employees e\
          RIGHT OUTER JOIN offices o ON e.officeCode = o.officeCode;").show(24)

+---------+---------+-------------+---------+
| lastName|firstName|         city|  country|
+---------+---------+-------------+---------+
| Thompson|   Leslie|San Francisco|      USA|
| Jennings|   Leslie|San Francisco|      USA|
|      Bow|  Anthony|San Francisco|      USA|
| Firrelli|     Jeff|San Francisco|      USA|
|Patterson|     Mary|San Francisco|      USA|
|   Murphy|    Diane|San Francisco|      USA|
|Patterson|    Steve|       Boston|      USA|
| Firrelli|    Julie|       Boston|      USA|
|   Vanauf|   George|          NYC|      USA|
|    Tseng| Foon Yue|          NYC|      USA|
|   Gerard|   Martin|        Paris|   France|
| Castillo|   Pamela|        Paris|   France|
|Hernandez|   Gerard|        Paris|   France|
|   Bondur|     Loui|        Paris|   France|
|   Bondur|   Gerard|        Paris|   France|
|     Kato|  Yoshimi|        Tokyo|    Japan|
|    Nishi|     Mami|        Tokyo|    Japan|
|     King|      Tom|       Sydney|Australia|
|    Marsh|    Peter|       Sydney|Australia|
|   Fixter|     Andy|       Sydney|Australia|
|Patterson|  William|       Sydney|Australia|
|    Jones|    Barry|       London|       UK|
|     Bott|    Larry|       London|       UK|
|     null|     null|        NYC 2|      USA|
+---------+---------+-------------+---------+

In [18]:
spark.stop()
sc.stop()